
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/NoxianNet/terraform/runs/run-1wWeUsSnp8qEmXBJ

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
cloudflare_zone.signalproxy_net: Refreshing state... [id=3c79663dde91c179d4a017a643698a4c]
cloudflare_record.test-domain: Refreshing state... [id=0707dac8b0b7e103b5d13710c94fd1c6]
linode_instance.reverse_proxy_docker: Refreshing state... [id=39723528]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.docker will be created
  + resource "cloudflare_record" "docker" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "docker"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = "172.104.31.229"
      + zone_id         = "3c79663dde91c179d4a017a643698a4c"
    }

  # cloudflare_record.docker-instance-subdomains["code"] will be created
  + resource "cloudflare_record" "docker-instance-subdomains" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "code"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "3c79663dde91c179d4a017a643698a4c"
    }

  # cloudflare_record.docker-instance-subdomains["code-server"] will be created
  + resource "cloudflare_record" "docker-instance-subdomains" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "code-server"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "3c79663dde91c179d4a017a643698a4c"
    }

  # cloudflare_record.docker-instance-subdomains["nginx"] will be created
  + resource "cloudflare_record" "docker-instance-subdomains" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "nginx"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "3c79663dde91c179d4a017a643698a4c"
    }

  # cloudflare_record.docker-instance-subdomains["portainer"] will be created
  + resource "cloudflare_record" "docker-instance-subdomains" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "portainer"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "3c79663dde91c179d4a017a643698a4c"
    }

  # cloudflare_record.docker-instance-subdomains["ssh"] will be created
  + resource "cloudflare_record" "docker-instance-subdomains" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ssh"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "3c79663dde91c179d4a017a643698a4c"
    }

  # cloudflare_record.docker-instance-subdomains["test"] will be created
  + resource "cloudflare_record" "docker-instance-subdomains" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "test"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "3c79663dde91c179d4a017a643698a4c"
    }

  # cloudflare_record.docker-instance-subdomains["vscode"] will be created
  + resource "cloudflare_record" "docker-instance-subdomains" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "vscode"
      + proxiable       = (known after apply)
      + ttl             = 60
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "3c79663dde91c179d4a017a643698a4c"
    }

  # cloudflare_record.test-domain will be destroyed
  # (because cloudflare_record.test-domain is not in configuration)
  - resource "cloudflare_record" "test-domain" {
      - allow_overwrite = false -> null
      - created_on      = "2022-10-22T17:46:55.739382Z" -> null
      - hostname        = "test.signalproxy.net" -> null
      - id              = "0707dac8b0b7e103b5d13710c94fd1c6" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2022-10-22T17:46:55.739382Z" -> null
      - name            = "test" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - ttl             = 60 -> null
      - type            = "A" -> null
      - value           = "172.104.31.229" -> null
      - zone_id         = "3c79663dde91c179d4a017a643698a4c" -> null
    }

  # cloudflare_zone.signalproxy_net will be updated in-place
  ~ resource "cloudflare_zone" "signalproxy_net" {
      - account_id          = "48eef5414862c314228eb6c1a2075d6e" -> null
        id                  = "3c79663dde91c179d4a017a643698a4c"
        # (8 unchanged attributes hidden)
    }

Plan: 8 to add, 1 to change, 1 to destroy.


```

</details>

*Pushed by: @TheNite, Action: `pull_request`*